services/facturisation-service/facturisationService/testmethod.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
  <soapenv:Header/>
  <soapenv:Body>
    <tem:TestMethod>
      <tem:input>Malek</tem:input>
    </tem:TestMethod>
  </soapenv:Body>
</soapenv:Envelope>
